In [1]:
import pandas as pd
import numpy as np
import warnings
from datetime import datetime, timedelta
warnings.filterwarnings('ignore')

# Human Resource / People analytics data.
Project for data cleaning and data visualisation. Read disclaimer attributed to the original author for this project.

# Data cleaning

## Extraction Phase

There is a total of 5 data in which one of them is about survey. The remaining 4 data is considered to essential for the overall analysis while the survey data will be separately used for engagement analysis. Both combined will create People Analytics.

I identified the 4 data as listed:
- company data → `2021.06_COL_2021.txt`
- job_detail data → `2021.06_job_profile_mapping.txt`
- full data → `CompanyData.txt`
- demographic data → `Diversity.txt`

In addition with survey data → `EngagementSurvey.txt`

In [2]:
def log(message):
    timestamp_format = '%Y-%h-%d-%H:%M:%S'
    now = datetime.now()
    timestamp = now.strftime(timestamp_format)
    with open("logfile.txt",'a') as f:
        f.write(timestamp+', '+message+'\n')
    print(message)

### Importing first 4 data

In [3]:
import time

In [4]:
log('Extracting Data ...')
start_time = time.time()

Extracting Data ...

In [5]:
company_data = pd.read_csv('data/2021.06_COL_2021.txt', sep='\t')
company_data.head()

    Office  COL Amount Currency
0      NYC         100      USD
1  Boulder          70      USD
2     Oslo          70      NOK
3  SanJose          90      USD
4   London          90      GBP

In [6]:
job_data = pd.read_csv('data/2021.06_job_profile_mapping.txt', sep='\t')
job_data.head()

,Department,Job_title,Job_Profile,Compensation,Level,Bonus %
0,Corporate,CEO,JP_1000,"500,000.00",CSuite,1.00
1,Corporate,HR Manager,JP_1001,"100,000.00",Manager,0.20
2,Corporate,AR Specialist,JP_1002,"65,000.00",Individual Contributor,0.15
3,Corporate,AP Specialist,JP_1003,"65,000.00",Individual Contributor,0.15
4,Corporate,FP&A Analyst,JP_1004,"70,000.00",Individual Contributor,0.15

In [7]:
full_data = pd.read_csv('data/CompanyData.txt', sep='\t', encoding='utf_16_le')
full_data.head()

,EmployeeID,First_Name,Surname,StreetAddress,City,State,StateFull,ZipCode,Country,CountryFull,...,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Job_Profile,Notes
0,100001,Patrice,Moore,1427 Buckhannan Avenue,North Syracuse,NY,New York,13212,US,United States,...,Corporate,USD,1.00,CEO,1/5/1986,CSuite,500000,1,JP_1000,Changes for 2021.06:
1,100002,David,Rickards,4265 Graystone Lakes,Macon,GA,Georgia,31206,US,United States,...,Corporate,USD,0.20,HR Manager,7/13/1971,Manager,70000,1,JP_1001,Changes for 2021.06:
2,100003,Grace,Maldonado,1680 Hudson Street,Weehawken,NJ,New Jersey,07087,US,United States,...,Marketing,USD,0.15,Graphic Designer,1/25/1989,Individual Contributor,77000,0,JP_1022,Changes for 2021.06:
3,100004,Justin,Edgin,1262 Limer Street,Rome,GA,Georgia,30165,US,United States,...,Technology,USD,0.50,CTO,5/1/1996,CSuite,400000,0,JP_1036,Changes for 2021.06:
4,100005,Benjamin,Vargas,2431 Rainbow Road,Santa Ana,CA,California,92705,US,United States,...,Customer Service,USD,0.15,Associate Account Manager,5/5/1972,Manager,51000,0,JP_1015,Changes for 2021.06:

In [8]:
demographic_data = pd.read_csv('data/Diversity.txt', sep='\t')
demographic_data.head()

,EmployeeID,Gender,Gender Identity,Race/Ethnicity,Veteran,Disability,Education,Sexual Orientation
0,100001,female,female,White,0,0,Undergraduate,Heterosexual
1,100002,male,male,White,0,1,Undergraduate,Heterosexual
2,100003,female,female,Asian,0,0,Undergraduate,Heterosexual
3,100004,male,male,White,0,0,Undergraduate,Heterosexual
4,100005,male,male,Hispanic or Latino,0,0,Undergraduate,Missing

In [9]:
survey_data = pd.read_csv('data/EngagementSurvey.txt', sep='\t')
survey_data.head()

,EmployeeID,Survey,I would recommend my friends or Family to work at TheCompany,I feel engaged in my work.,I believe Leadership cares about the employees at TheCompany,My manager supports me in my role at TheCompany,"TheCompany cares about Diversity, Equity and Inclusion.",I believe there is room for me to grow at TheCompany,I work on interesting projects.,My manager motivates me to work hard.,...,I believe TheCompany is in a great position in the market for the next few years to be succesful.,I plan on staying with TheCompany for at least 2 more years.,I believe I am fairly compensated for my work.,I believe there is little to not politics at TheCompany,I feel comfortable going to someone in leadership if there is an issue.,My values align with the culture at TheCompany,I know what TheCompany values are at TheCompany,I feel like I can take off my accrued Paid Time Off (PTO)/Vacation without feeling guilty,What does TheCompany do well?,What can TheCompany improve?
0,100001,2023Q2,3,3,2,1,1,3,2,4,...,3,4,2,2,4,4,3,3,NaN,NaN
1,100002,2023Q2,3,4,2,4,2,4,4,2,...,3,1,5,1,2,4,3,1,NaN,NaN
2,100009,2023Q2,3,4,2,3,4,3,2,2,...,1,1,3,2,2,3,2,4,NaN,NaN
3,100014,2023Q2,4,1,5,2,5,3,4,4,...,3,4,2,2,4,3,3,2,NaN,NaN
4,100018,2023Q2,4,1,1,1,2,3,1,3,...,4,3,2,4,3,2,2,3,NaN,NaN

In [10]:
log('Extraction done in --- %s seconds ---' % (time.time()-start_time))

Extraction done in --- 0.2184157371520996 seconds ---

# Transformation Phase

In [11]:
log('Transforming Data ...')
start_time = time.time()

Transforming Data ...

Let's first find out how many data we have in each table

In [12]:
print('The company data has {0} columns and {1} rows'.format(company_data.shape[1],company_data.shape[0]))
print('The job data has {0} columns and {1} rows'.format(job_data.shape[1],job_data.shape[0]))
print('The full data has {0} columns and {1} rows'.format(full_data.shape[1],full_data.shape[0]))
print('The demographic data has {0} columns and {1} rows'.format(demographic_data.shape[1],demographic_data.shape[0]))
print('The survey data has {0} columns and {1} rows'.format(survey_data.shape[1],survey_data.shape[0]))

The company data has 3 columns and 9 rows
The job data has 6 columns and 54 rows
The full data has 25 columns and 4968 rows
The demographic data has 8 columns and 4968 rows
The survey data has 23 columns and 2827 rows

## Company Data

In [13]:
company_data

     Office  COL Amount Currency
0       NYC         100      USD
1   Boulder          70      USD
2      Oslo          70      NOK
3   SanJose          90      USD
4    London          90      GBP
5     Tokyo          85      JPY
6  HongKong          85      HKD
7   SanFran         100      USD
8    Austin          70      USD

We are going to remove `COL Amount` because it is not relevant to analysis.

In [14]:
company_data.drop('COL Amount', axis=1, inplace=True)

The table stores office details, it does not contain any meaningful features, so I decided to remove `COL Amount` for now.

## Job data

In [15]:
job_data.head(10)

,Department,Job_title,Job_Profile,Compensation,Level,Bonus %
0,Corporate,CEO,JP_1000,"500,000.00",CSuite,1.00
1,Corporate,HR Manager,JP_1001,"100,000.00",Manager,0.20
2,Corporate,AR Specialist,JP_1002,"65,000.00",Individual Contributor,0.15
3,Corporate,AP Specialist,JP_1003,"65,000.00",Individual Contributor,0.15
4,Corporate,FP&A Analyst,JP_1004,"70,000.00",Individual Contributor,0.15
5,Corporate,Coordinator,JP_1005,"50,000.00",Individual Contributor,0.15
6,Corporate,HR Coordinator,JP_1006,"50,000.00",Individual Contributor,0.15
7,Corporate,Counsel,JP_1007,"220,000.00",Individual Contributor,0.15
8,Corporate,Finance Coordinator,JP_1008,"55,000.00",Individual Contributor,0.15
9,Corporate,Accountant,JP_1009,"85,000.00",Individual Contributor,0.15

In [16]:
job_data.describe(include='all')

,Department,Job_title,Job_Profile,Compensation,Level,Bonus %
count,54,54,54,54,54,54.000000
unique,5,54,54,31,8,NaN
top,Corporate,CEO,JP_1000,"85,000.00",Individual Contributor,NaN
freq,21,1,1,4,20,NaN
mean,NaN,NaN,NaN,NaN,NaN,0.227778
std,NaN,NaN,NaN,NaN,NaN,0.150680
min,NaN,NaN,NaN,NaN,NaN,0.100000
25%,NaN,NaN,NaN,NaN,NaN,0.150000
50%,NaN,NaN,NaN,NaN,NaN,0.150000
75%,NaN,NaN,NaN,NaN,NaN,0.200000
max,NaN,NaN,NaN,NaN,NaN,1.000000

### Converting `Compensation` into float data type

In [17]:
job_data.rename(columns={' Compensation ':'Compensation'}, inplace=True)
job_data['Compensation']=job_data['Compensation'].str.strip().str.replace(',','')
job_data['Compensation']=pd.to_numeric(job_data['Compensation'])

In [18]:
job_data.head()

,Department,Job_title,Job_Profile,Compensation,Level,Bonus %
0,Corporate,CEO,JP_1000,500000.0,CSuite,1.00
1,Corporate,HR Manager,JP_1001,100000.0,Manager,0.20
2,Corporate,AR Specialist,JP_1002,65000.0,Individual Contributor,0.15
3,Corporate,AP Specialist,JP_1003,65000.0,Individual Contributor,0.15
4,Corporate,FP&A Analyst,JP_1004,70000.0,Individual Contributor,0.15

In [19]:
job_data.describe(include='all')

,Department,Job_title,Job_Profile,Compensation,Level,Bonus %
count,54,54,54,54.000000,54,54.000000
unique,5,54,54,NaN,8,NaN
top,Corporate,CEO,JP_1000,NaN,Individual Contributor,NaN
freq,21,1,1,NaN,20,NaN
mean,NaN,NaN,NaN,164907.407407,NaN,0.227778
std,NaN,NaN,NaN,116584.614752,NaN,0.150680
min,NaN,NaN,NaN,50000.000000,NaN,0.100000
25%,NaN,NaN,NaN,76250.000000,NaN,0.150000
50%,NaN,NaN,NaN,115000.000000,NaN,0.150000
75%,NaN,NaN,NaN,215000.000000,NaN,0.200000
max,NaN,NaN,NaN,500000.000000,NaN,1.000000

In [20]:
job_data.isna().sum()

Department      0
Job_title       0
Job_Profile     0
Compensation    0
Level           0
Bonus %         0
dtype: int64

The job details data does not have any null values. At the current stage, I only need to convert `Compensation` data type.

Changes note: Adding validation discovered in normalization

Checking if job profile in full_data matches job profile in job_data

In [21]:
job_data.rename(columns={'Compensation':'Salary', 'Bonus %':'Bonus_pct', 'Level':'level'}, inplace=True)
col_to_drop = list(job_data.columns)
col_to_drop

['Department', 'Job_title', 'Job_Profile', 'Salary', 'level', 'Bonus_pct']

In [22]:
job_copy = job_data.copy()

In [23]:
job_data.equals(job_copy)

True

In [24]:
job_copy=job_copy[['Job_Profile']]
job_copy.head()

  Job_Profile
0     JP_1000
1     JP_1001
2     JP_1002
3     JP_1003
4     JP_1004

In [25]:
col_to_drop.remove('Salary')
job_copy = job_copy.merge(full_data[col_to_drop], on='Job_Profile', how='left').drop_duplicates()
print(job_copy.shape)
job_copy.reset_index(drop=True,inplace=True)
job_copy

(60, 5)

,Job_Profile,Department,Job_title,level,Bonus_pct
0,JP_1000,Corporate,CEO,CSuite,1.00
1,JP_1001,Corporate,HR Manager,Manager,0.20
2,JP_1001,Corporate,HR Manager,Individual Contributor,0.20
3,JP_1002,Corporate,AR Specialist,Individual Contributor,0.15
4,JP_1003,Corporate,AP Specialist,Individual Contributor,0.15
5,JP_1004,Corporate,FP&A Analyst,Individual Contributor,0.15
6,JP_1005,Corporate,Coordinator,Individual Contributor,0.15
7,JP_1006,Corporate,HR Coordinator,Individual Contributor,0.15
8,JP_1007,Corporate,Counsel,Individual Contributor,0.15
9,JP_1008,Corporate,Finance Coordinator,Individual Contributor,0.15
10,JP_1009,Corporate,Accountant,Individual Contributor,0.15
11,JP_1010,Corporate,"Specialist, Training and Development",Individual Contributor,0.15
12,JP_1011,Corporate,"Manager, Corporate",Individual Contributor,0.15
13,JP_1011,Corporate,"Manager, Corporate",Manager,0.15
14,JP_1011,Corporate,"Manager, Corporate",Director,0.15
15,JP_1012,Corporate,"VP, Corporate",VP,0.30
16,JP_1013,Corporate,HR Generalist,Individual Contributor,0.15
17,JP_1014,Corporate,HR Analyst,Individual Contributor,0.15
18,JP_1015,Customer Service,Associate Account Manager,Manager,0.15
19,JP_1015,Customer Service,Associate Account Manager,Associate,0.15
20,JP_1016,Customer Service,Account Manager,Individual Contributor,0.15
21,JP_1017,Customer Service,"SVP, Customer Service",SVP,0.30
22,JP_1018,Customer Service,Senior Account Manager,Senior,0.15
23,JP_1019,Customer Service,"Manager, Customer Service",Manager,0.20
24,JP_1019,Customer Service,"Manager, Customer Service",Associate,0.20
25,JP_1020,Customer Service,CS Operations Specialist,Individual Contributor,0.15
26,JP_1021,Customer Service,"Director, Customer Service",Director,0.20
27,JP_1022,Marketing,Graphic Designer,Individual Contributor,0.15
28,JP_1023,Marketing,Programmatic Marketing Specialist,Individual Contributor,0.15
29,JP_1024,Marketing,Copy Writer,Individual Contributor,0.15
30,JP_1025,Marketing,"Associate, Marketing",Associate,0.10
31,JP_1026,Marketing,"VP, Marketing",VP,0.30
32,JP_1027,Marketing,"Manager, Marketing",Manager,0.20
33,JP_1028,Marketing,"Director, Marketing",Director,0.20
34,JP_1029,Sales,Account Executive,Individual Contributor,0.15
35,JP_1030,Sales,"Director, Sales",Director,0.20
36,JP_1031,Sales,Regional Sales Manager,Manager,0.20
37,JP_1032,Sales,Sales Manager,Manager,0.20
38,JP_1033,Sales,"SVP, Sales",SVP,0.30
39,JP_1034,Sales,Sales Team Lead,Senior,0.15
40,JP_1035,Sales,"Associate, Sales",Associate,0.10
41,JP_1036,Technology,CTO,CSuite,0.50
42,JP_1037,Technology,IT,Individual Contributor,0.15
43,JP_1038,Technology,Software Engineer,Individual Contributor,0.15
44,JP_1038,Corporate,Software Engineer,Individual Contributor,0.15
45,JP_1039,Technology,"Director, Engineering",Director,0.20
46,JP_1040,Technology,Senior Software Engineer,Senior,0.15
47,JP_1041,Technology,"VP, Technology",VP,0.30
48,JP_1042,Technology,"Manager, Engineering",Manager,0.20
49,JP_1043,Technology,"SVP, Technology",SVP,0.30
50,JP_1044,Marketing,"Senior, Copy Writer",Senior,0.15
51,JP_1045,Marketing,Chief Marketing Officer,CSuite,0.50
52,JP_1046,Marketing,"SVP, Marketing",SVP,0.30
53,JP_1047,Corporate,"Manager, Finance",Manager,0.20
54,JP_1048,Corporate,Chief Financial Officer,CSuite,0.50
55,JP_1049,Corporate,Chief Human Resources Officer,CSuite,0.50
56,JP_1050,Corporate,"Senior, Finance",Senior,0.15
57,JP_1051,Corporate,"Director, HR",Director,0.20
58,JP_1052,Corporate,"Director, Finance",Director,0.20
59,JP_1053,Customer Service,Chieft Customer Officer,CSuite,0.50

Obviously, there are duplicated values of job profile. `Salary` was omitted here because it does not depend on job profile. If we had included `Salary`, there will be **750** unique job profiles. We are going to add the new job profiles created above by creating new job_profile (ids). This will not remove the original job profile, instead we add more job profiles. Originally we have 54 job profiles, now we will ad 6 more.

Creating new job profiles

In [26]:
job_copy.drop('Job_Profile',axis=1, inplace=True)
job_copy['Job_Profile']=['JP_'+str(i) for i in range(1000,1000+job_copy.shape[0])]
job_copy

,Department,Job_title,level,Bonus_pct,Job_Profile
0,Corporate,CEO,CSuite,1.00,JP_1000
1,Corporate,HR Manager,Manager,0.20,JP_1001
2,Corporate,HR Manager,Individual Contributor,0.20,JP_1002
3,Corporate,AR Specialist,Individual Contributor,0.15,JP_1003
4,Corporate,AP Specialist,Individual Contributor,0.15,JP_1004
5,Corporate,FP&A Analyst,Individual Contributor,0.15,JP_1005
6,Corporate,Coordinator,Individual Contributor,0.15,JP_1006
7,Corporate,HR Coordinator,Individual Contributor,0.15,JP_1007
8,Corporate,Counsel,Individual Contributor,0.15,JP_1008
9,Corporate,Finance Coordinator,Individual Contributor,0.15,JP_1009
10,Corporate,Accountant,Individual Contributor,0.15,JP_1010
11,Corporate,"Specialist, Training and Development",Individual Contributor,0.15,JP_1011
12,Corporate,"Manager, Corporate",Individual Contributor,0.15,JP_1012
13,Corporate,"Manager, Corporate",Manager,0.15,JP_1013
14,Corporate,"Manager, Corporate",Director,0.15,JP_1014
15,Corporate,"VP, Corporate",VP,0.30,JP_1015
16,Corporate,HR Generalist,Individual Contributor,0.15,JP_1016
17,Corporate,HR Analyst,Individual Contributor,0.15,JP_1017
18,Customer Service,Associate Account Manager,Manager,0.15,JP_1018
19,Customer Service,Associate Account Manager,Associate,0.15,JP_1019
20,Customer Service,Account Manager,Individual Contributor,0.15,JP_1020
21,Customer Service,"SVP, Customer Service",SVP,0.30,JP_1021
22,Customer Service,Senior Account Manager,Senior,0.15,JP_1022
23,Customer Service,"Manager, Customer Service",Manager,0.20,JP_1023
24,Customer Service,"Manager, Customer Service",Associate,0.20,JP_1024
25,Customer Service,CS Operations Specialist,Individual Contributor,0.15,JP_1025
26,Customer Service,"Director, Customer Service",Director,0.20,JP_1026
27,Marketing,Graphic Designer,Individual Contributor,0.15,JP_1027
28,Marketing,Programmatic Marketing Specialist,Individual Contributor,0.15,JP_1028
29,Marketing,Copy Writer,Individual Contributor,0.15,JP_1029
30,Marketing,"Associate, Marketing",Associate,0.10,JP_1030
31,Marketing,"VP, Marketing",VP,0.30,JP_1031
32,Marketing,"Manager, Marketing",Manager,0.20,JP_1032
33,Marketing,"Director, Marketing",Director,0.20,JP_1033
34,Sales,Account Executive,Individual Contributor,0.15,JP_1034
35,Sales,"Director, Sales",Director,0.20,JP_1035
36,Sales,Regional Sales Manager,Manager,0.20,JP_1036
37,Sales,Sales Manager,Manager,0.20,JP_1037
38,Sales,"SVP, Sales",SVP,0.30,JP_1038
39,Sales,Sales Team Lead,Senior,0.15,JP_1039
40,Sales,"Associate, Sales",Associate,0.10,JP_1040
41,Technology,CTO,CSuite,0.50,JP_1041
42,Technology,IT,Individual Contributor,0.15,JP_1042
43,Technology,Software Engineer,Individual Contributor,0.15,JP_1043
44,Corporate,Software Engineer,Individual Contributor,0.15,JP_1044
45,Technology,"Director, Engineering",Director,0.20,JP_1045
46,Technology,Senior Software Engineer,Senior,0.15,JP_1046
47,Technology,"VP, Technology",VP,0.30,JP_1047
48,Technology,"Manager, Engineering",Manager,0.20,JP_1048
49,Technology,"SVP, Technology",SVP,0.30,JP_1049
50,Marketing,"Senior, Copy Writer",Senior,0.15,JP_1050
51,Marketing,Chief Marketing Officer,CSuite,0.50,JP_1051
52,Marketing,"SVP, Marketing",SVP,0.30,JP_1052
53,Corporate,"Manager, Finance",Manager,0.20,JP_1053
54,Corporate,Chief Financial Officer,CSuite,0.50,JP_1054
55,Corporate,Chief Human Resources Officer,CSuite,0.50,JP_1055
56,Corporate,"Senior, Finance",Senior,0.15,JP_1056
57,Corporate,"Director, HR",Director,0.20,JP_1057
58,Corporate,"Director, Finance",Director,0.20,JP_1058
59,Customer Service,Chieft Customer Officer,CSuite,0.50,JP_1059

In [27]:
job_data[job_data.duplicated(subset='Job_Profile')] # Check if there are still duplicates

Empty DataFrame
Columns: [Department, Job_title, Job_Profile, Salary, level, Bonus_pct]
Index: []

In [28]:
full_data.drop('Job_Profile', axis=1, inplace=True)

In [29]:
col_to_drop.remove('Job_Profile')

In [30]:
full_data=full_data.merge(job_copy, on=col_to_drop, how='left')
full_data.head(10)

,EmployeeID,First_Name,Surname,StreetAddress,City,State,StateFull,ZipCode,Country,CountryFull,...,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Notes,Job_Profile
0,100001,Patrice,Moore,1427 Buckhannan Avenue,North Syracuse,NY,New York,13212,US,United States,...,Corporate,USD,1.00,CEO,1/5/1986,CSuite,500000,1,Changes for 2021.06:,JP_1000
1,100002,David,Rickards,4265 Graystone Lakes,Macon,GA,Georgia,31206,US,United States,...,Corporate,USD,0.20,HR Manager,7/13/1971,Manager,70000,1,Changes for 2021.06:,JP_1001
2,100003,Grace,Maldonado,1680 Hudson Street,Weehawken,NJ,New Jersey,07087,US,United States,...,Marketing,USD,0.15,Graphic Designer,1/25/1989,Individual Contributor,77000,0,Changes for 2021.06:,JP_1027
3,100004,Justin,Edgin,1262 Limer Street,Rome,GA,Georgia,30165,US,United States,...,Technology,USD,0.50,CTO,5/1/1996,CSuite,400000,0,Changes for 2021.06:,JP_1041
4,100005,Benjamin,Vargas,2431 Rainbow Road,Santa Ana,CA,California,92705,US,United States,...,Customer Service,USD,0.15,Associate Account Manager,5/5/1972,Manager,51000,0,Changes for 2021.06:,JP_1018
5,100006,Nelson,Grillo,3645 Coolidge Street,North Custer,MT,Montana,59024,US,United States,...,Sales,USD,0.15,Account Executive,6/21/1993,Individual Contributor,76000,1,Changes for 2021.06: Termed,JP_1034
6,100007,Kevin,Rainey,977 Black Oak Hollow Road,Santa Clara,CA,California,95054,US,United States,...,Customer Service,USD,0.15,Account Manager,5/13/1990,Individual Contributor,56000,0,Changes for 2021.06:,JP_1020
7,100008,Melanie,Hurst,2751 Holden Street,San Diego,CA,California,92103,US,United States,...,Sales,USD,0.15,Account Executive,1/23/1983,Individual Contributor,72000,0,Changes for 2021.06:,JP_1034
8,100009,Greg,Boon,4791 Loving Acres Road,Grapevine,TX,Texas,76051,US,United States,...,Sales,USD,0.20,"Director, Sales",1/4/1992,Director,74000,1,Changes for 2021.06:,JP_1035
9,100010,Frank,Stockdale,1413 Roy Alley,Centennial,CO,Colorado,80111,US,United States,...,Customer Service,USD,0.15,Account Manager,10/21/1989,Individual Contributor,52000,0,Changes for 2021.06:,JP_1020

In [31]:
full_data.columns

Index(['EmployeeID', 'First_Name', 'Surname', 'StreetAddress', 'City', 'State',
       'StateFull', 'ZipCode', 'Country', 'CountryFull', 'Age', 'Office',
       'Start_Date', 'Termination_Date', 'Office_Type', 'Department',
       'Currency', 'Bonus_pct', 'Job_title', 'DOB', 'level', 'Salary',
       'Active Status', 'Notes', 'Job_Profile'],
      dtype='object')

Validated Job profile for job_data, created new job profiles and fixing it inside full_data.

## Full data

In [32]:
full_data.head(10)

,EmployeeID,First_Name,Surname,StreetAddress,City,State,StateFull,ZipCode,Country,CountryFull,...,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Notes,Job_Profile
0,100001,Patrice,Moore,1427 Buckhannan Avenue,North Syracuse,NY,New York,13212,US,United States,...,Corporate,USD,1.00,CEO,1/5/1986,CSuite,500000,1,Changes for 2021.06:,JP_1000
1,100002,David,Rickards,4265 Graystone Lakes,Macon,GA,Georgia,31206,US,United States,...,Corporate,USD,0.20,HR Manager,7/13/1971,Manager,70000,1,Changes for 2021.06:,JP_1001
2,100003,Grace,Maldonado,1680 Hudson Street,Weehawken,NJ,New Jersey,07087,US,United States,...,Marketing,USD,0.15,Graphic Designer,1/25/1989,Individual Contributor,77000,0,Changes for 2021.06:,JP_1027
3,100004,Justin,Edgin,1262 Limer Street,Rome,GA,Georgia,30165,US,United States,...,Technology,USD,0.50,CTO,5/1/1996,CSuite,400000,0,Changes for 2021.06:,JP_1041
4,100005,Benjamin,Vargas,2431 Rainbow Road,Santa Ana,CA,California,92705,US,United States,...,Customer Service,USD,0.15,Associate Account Manager,5/5/1972,Manager,51000,0,Changes for 2021.06:,JP_1018
5,100006,Nelson,Grillo,3645 Coolidge Street,North Custer,MT,Montana,59024,US,United States,...,Sales,USD,0.15,Account Executive,6/21/1993,Individual Contributor,76000,1,Changes for 2021.06: Termed,JP_1034
6,100007,Kevin,Rainey,977 Black Oak Hollow Road,Santa Clara,CA,California,95054,US,United States,...,Customer Service,USD,0.15,Account Manager,5/13/1990,Individual Contributor,56000,0,Changes for 2021.06:,JP_1020
7,100008,Melanie,Hurst,2751 Holden Street,San Diego,CA,California,92103,US,United States,...,Sales,USD,0.15,Account Executive,1/23/1983,Individual Contributor,72000,0,Changes for 2021.06:,JP_1034
8,100009,Greg,Boon,4791 Loving Acres Road,Grapevine,TX,Texas,76051,US,United States,...,Sales,USD,0.20,"Director, Sales",1/4/1992,Director,74000,1,Changes for 2021.06:,JP_1035
9,100010,Frank,Stockdale,1413 Roy Alley,Centennial,CO,Colorado,80111,US,United States,...,Customer Service,USD,0.15,Account Manager,10/21/1989,Individual Contributor,52000,0,Changes for 2021.06:,JP_1020

In [33]:
full_data['Notes']

0                              Changes for 2021.06:
1                              Changes for 2021.06:
2                              Changes for 2021.06:
3                              Changes for 2021.06:
4                              Changes for 2021.06:
                            ...
4963    Changes for 2021.06: Added on 2021.06, Termed
4964          Changes for 2021.06: Added on 2021.06,
4965          Changes for 2021.06: Added on 2021.06,
4966          Changes for 2021.06: Added on 2021.06,
4967          Changes for 2021.06: Added on 2021.06,
Name: Notes, Length: 4968, dtype: object

Unseen Columns

In [34]:
full_data.head().iloc[:,5:]

,State,StateFull,ZipCode,Country,CountryFull,Age,Office,Start_Date,Termination_Date,Office_Type,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Notes,Job_Profile
0,NY,New York,13212,US,United States,35,NYC,5/4/2009,12/12/2999,Corporate,Corporate,USD,1.00,CEO,1/5/1986,CSuite,500000,1,Changes for 2021.06:,JP_1000
1,GA,Georgia,31206,US,United States,49,NYC,5/4/2009,12/12/2999,Corporate,Corporate,USD,0.20,HR Manager,7/13/1971,Manager,70000,1,Changes for 2021.06:,JP_1001
2,NJ,New Jersey,07087,US,United States,32,NYC,5/18/2009,6/5/2013,Corporate,Marketing,USD,0.15,Graphic Designer,1/25/1989,Individual Contributor,77000,0,Changes for 2021.06:,JP_1027
3,GA,Georgia,30165,US,United States,25,Boulder,6/22/2009,10/16/2013,Corporate,Technology,USD,0.50,CTO,5/1/1996,CSuite,400000,0,Changes for 2021.06:,JP_1041
4,CA,California,92705,US,United States,49,NYC,7/13/2009,1/10/2011,Corporate,Customer Service,USD,0.15,Associate Account Manager,5/5/1972,Manager,51000,0,Changes for 2021.06:,JP_1018

In [35]:
full_data.describe(include='all').iloc[:,:13]

,EmployeeID,First_Name,Surname,StreetAddress,City,State,StateFull,ZipCode,Country,CountryFull,Age,Office,Start_Date
count,4968.000000,4968,4968,4846,4846,4446,4445,4968,4968,4968,4968.000000,4968,4968
unique,NaN,1455,2863,4843,1962,101,51,2837,5,5,NaN,9,609
top,NaN,James,Smith,4866 Fairfax Drive,New York,CA,California,0,US,United States,NaN,NYC,1/12/2015
freq,NaN,97,78,2,87,445,494,122,4446,4446,NaN,1796,41
mean,102484.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,44.187399,NaN,NaN
std,1434.282399,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,12.368092,NaN,NaN
min,100001.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,19.000000,NaN,NaN
25%,101242.750000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,34.000000,NaN,NaN
50%,102484.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,44.000000,NaN,NaN
75%,103726.250000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,54.000000,NaN,NaN
max,104968.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,90.000000,NaN,NaN

In [36]:
full_data.describe(include='all').iloc[:,13:]

,Termination_Date,Office_Type,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Notes,Job_Profile
count,4968,4968,4968,4968,4968.000000,4968,4968,4968,4.968000e+03,4968.000000,4968,4968
unique,1797,2,5,5,NaN,54,4268,8,NaN,NaN,4,60
top,12/12/2999,Corporate,Technology,USD,NaN,Software Engineer,6/10/1983,Individual Contributor,NaN,NaN,Changes for 2021.06:,JP_1043
freq,2413,2972,1915,4446,NaN,1019,5,2947,NaN,NaN,3921,1016
mean,NaN,NaN,NaN,NaN,0.160688,NaN,NaN,NaN,1.502856e+05,0.626610,NaN,NaN
std,NaN,NaN,NaN,NaN,0.035295,NaN,NaN,NaN,6.169536e+05,0.483753,NaN,NaN
min,NaN,NaN,NaN,NaN,0.100000,NaN,NaN,NaN,2.000000e+03,0.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,0.150000,NaN,NaN,NaN,5.800000e+04,0.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,0.150000,NaN,NaN,NaN,7.600000e+04,1.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,0.150000,NaN,NaN,NaN,9.400000e+04,1.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,1.000000,NaN,NaN,NaN,9.501000e+06,1.000000,NaN,NaN

### Data Validation

We are going to check whether there is any values that violate data integrity. First, we will check the age of the employees.  
I am going to do a general check first by checking the distribution of employees' age. This can be found out in the descriptive statistics above and below for detailed view.

In [37]:
full_data.describe(include='all').loc[:,'Age']

count     4968.000000
unique            NaN
top               NaN
freq              NaN
mean        44.187399
std         12.368092
min         19.000000
25%         34.000000
50%         44.000000
75%         54.000000
max         90.000000
Name: Age, dtype: float64

Check complete. The minimum age is 19 and the maximum age is 90. This looks normal except probably age 90 where it could be the CEO or someone with high position.

Now, we are going to check the termination date. We are going to do a simple check where the value cannot be more than the today date. However, this value actually can be true because some employee might give notice or had a plan to quit the company in near future (all back to company rules).

Notice that the termination_date includes 12/12/2999 which indicate that the employee has not terminated yet. For example:

In [38]:
full_data.loc[full_data['Termination_Date']=='12/12/2999'].head()

,EmployeeID,First_Name,Surname,StreetAddress,City,State,StateFull,ZipCode,Country,CountryFull,...,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Notes,Job_Profile
0,100001,Patrice,Moore,1427 Buckhannan Avenue,North Syracuse,NY,New York,13212,US,United States,...,Corporate,USD,1.00,CEO,1/5/1986,CSuite,500000,1,Changes for 2021.06:,JP_1000
1,100002,David,Rickards,4265 Graystone Lakes,Macon,GA,Georgia,31206,US,United States,...,Corporate,USD,0.20,HR Manager,7/13/1971,Manager,70000,1,Changes for 2021.06:,JP_1001
8,100009,Greg,Boon,4791 Loving Acres Road,Grapevine,TX,Texas,76051,US,United States,...,Sales,USD,0.20,"Director, Sales",1/4/1992,Director,74000,1,Changes for 2021.06:,JP_1035
13,100014,Jacqueline,Hernandez,1676 Hidden Meadow Drive,Crystal,ND,North Dakota,58222,US,United States,...,Corporate,USD,0.15,AP Specialist,10/29/1997,Individual Contributor,67000,1,Changes for 2021.06:,JP_1004
17,100018,Virginia,Ferguson,3024 Traders Alley,Maysville,MO,Missouri,64469,US,United States,...,Customer Service,USD,0.30,"SVP, Customer Service",6/20/1993,SVP,198000,1,Changes for 2021.06:,JP_1021

For data analysis purpose, replacing it with `NaN` will be more meaningful.  
Now we can check for termination date that is past today date.

In [39]:
full_data['Start_Date']=pd.to_datetime(full_data['Start_Date'])
full_data['Termination_Date']=pd.to_datetime(full_data['Termination_Date'], errors='coerce')
full_data.dtypes

EmployeeID                   int64
First_Name                  object
Surname                     object
StreetAddress               object
City                        object
State                       object
StateFull                   object
ZipCode                     object
Country                     object
CountryFull                 object
Age                          int64
Office                      object
Start_Date          datetime64[ns]
Termination_Date    datetime64[ns]
Office_Type                 object
Department                  object
Currency                    object
Bonus_pct                  float64
Job_title                   object
DOB                         object
level                       object
Salary                       int64
Active Status                int64
Notes                       object
Job_Profile                 object
dtype: object

In [40]:
from datetime import datetime,timedelta

full_data.loc[full_data['Termination_Date']>datetime.today(),'Start_Date':]

,Start_Date,Termination_Date,Office_Type,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Notes,Job_Profile
189,2010-12-27,2023-10-28,Technology,Technology,USD,0.30,"VP, Technology",11/17/1987,VP,98000,1,Changes for 2021.06: Termed,JP_1047
240,2011-02-28,2023-07-01,Technology,Technology,USD,0.15,Software Engineer,8/2/1957,Individual Contributor,97000,1,Changes for 2021.06: Termed,JP_1043
257,2011-03-14,2023-08-24,Technology,Technology,USD,0.15,Senior Software Engineer,5/13/1969,Senior,99000,1,Changes for 2021.06: Termed,JP_1046
351,2011-08-22,2023-09-22,Technology,Technology,USD,0.15,Software Engineer,1/26/1961,Individual Contributor,99000,1,Changes for 2021.06: Termed,JP_1043
352,2011-08-22,2023-12-14,Technology,Technology,USD,0.15,Software Engineer,5/11/1985,Individual Contributor,94000,1,Changes for 2021.06: Termed,JP_1043
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4828,2021-03-01,2023-10-07,Technology,Technology,USD,0.15,Software Engineer,8/23/1974,Individual Contributor,77000,1,"Changes for 2021.06: Added on 2021.06, Termed",JP_1043
4886,2021-09-27,2023-10-24,Technology,Customer Service,USD,0.20,"Manager, Customer Service",5/19/1981,Manager,76500,1,"Changes for 2021.06: Added on 2021.06, Termed",JP_1023
4909,2021-05-17,2023-07-07,Corporate,Corporate,USD,0.15,HR Analyst,11/22/1958,Individual Contributor,65000,1,"Changes for 2021.06: Added on 2021.06, Termed",JP_1017
4951,2021-09-13,2023-10-22,Technology,Customer Service,USD,0.15,CS Operations Specialist,12/5/1958,Individual Contributor,80000,1,"Changes for 2021.06: Added on 2021.06, Termed",JP_1025
4954,2021-09-13,2023-06-29,Corporate,Customer Service,USD,0.15,CS Operations Specialist,8/15/1961,Individual Contributor,80000,1,"Changes for 2021.06: Added on 2021.06, Termed",JP_1025

It turns out there is a lot of rows with termination date violating data integrity **(124 rows)**. Obviously this can or cannot happen in real-world scenario (depends on company rules). The company might allow for employee to give for example 1 month notice period. But, more than 1 month is a little unrealistic. So, for this project purposes, we are going to convert the termination date to today's date.

While we are at it, might have to check if there are any data that has start date after termination date.

In [41]:
full_data.loc[full_data['Termination_Date']<full_data['Start_Date'],'Start_Date':]

Empty DataFrame
Columns: [Start_Date, Termination_Date, Office_Type, Department, Currency, Bonus_pct, Job_title, DOB, level, Salary, Active Status, Notes, Job_Profile]
Index: []

Check complete.

In [42]:
# Converting termination date to today's date
full_data['Termination_Date'].loc[full_data['Termination_Date']>datetime.today()]=datetime.today()
full_data.iloc[189,12:]

Start_Date                   2010-12-27 00:00:00
Termination_Date      2023-06-18 19:12:34.307585
Office_Type                           Technology
Department                            Technology
Currency                                     USD
Bonus_pct                                    0.3
Job_title                         VP, Technology
DOB                                   11/17/1987
level                                         VP
Salary                                     98000
Active Status                                  1
Notes               Changes for 2021.06:  Termed
Job_Profile                              JP_1047
Name: 189, dtype: object

Dropping `Notes` column.

In [43]:
full_data.drop('Notes', axis=1, inplace=True)

Adding `start_year` and `termination_year` as a column

In [44]:
full_data['start_year']=full_data['Start_Date'].dt.strftime('%Y')
full_data['termination_year']=full_data['Termination_Date'].dt.strftime('%Y')
full_data.tail().iloc[:,12:]

,Start_Date,Termination_Date,Office_Type,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Job_Profile,start_year,termination_year
4963,2021-03-08,2022-11-27,Corporate,Marketing,USD,0.50,Chief Marketing Officer,11/27/1950,CSuite,370000,1,JP_1051,2021,2022
4964,2021-01-25,NaT,Technology,Technology,USD,0.15,Software Engineer,7/5/1975,Individual Contributor,77000,1,JP_1043,2021,NaN
4965,2021-08-23,NaT,Corporate,Sales,USD,0.15,Sales Team Lead,4/3/1982,Senior,85500,1,JP_1039,2021,NaN
4966,2021-02-01,NaT,Technology,Technology,USD,0.15,Senior Software Engineer,6/18/2001,Senior,98000,1,JP_1046,2021,NaN
4967,2021-09-06,NaT,Corporate,Corporate,USD,0.50,Chief Financial Officer,2/6/1970,CSuite,390000,1,JP_1054,2021,NaN

In [45]:
full_data['termination_year'].fillna(0, inplace=True) # Fill null values in termination year with 0
full_data = full_data.astype({'start_year':int,'termination_year':int})

Adding `tenure_months` and `tenure_years` to data by identifying whether employee still active or not

Before we add, we are going to check if active status is true to termination date i.e. checking if there is any employee with active status true having terminated.

In [46]:
full_data.loc[(full_data['Active Status']==1) & (full_data['termination_year']>0)]

,EmployeeID,First_Name,Surname,StreetAddress,City,State,StateFull,ZipCode,Country,CountryFull,...,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Job_Profile,start_year,termination_year
5,100006,Nelson,Grillo,3645 Coolidge Street,North Custer,MT,Montana,59024,US,United States,...,USD,0.15,Account Executive,6/21/1993,Individual Contributor,76000,1,JP_1034,2009,2021
32,100033,Fannie,Smith,1829 Burnside Court,Phoenix,AZ,Arizona,85003,US,United States,...,USD,0.15,HR Coordinator,1/16/1976,Individual Contributor,67000,1,JP_1007,2009,2022
35,100036,Joellen,Deleon,4719 Edgewood Avenue,Fresno,CA,California,93704,US,United States,...,USD,0.15,Senior Account Manager,6/19/1986,Senior,59000,1,JP_1022,2010,2021
62,100063,Marius,Andersen,Bnntjernveien 186,HNEFOSS,NaN,NaN,03514,NO,Norway,...,NOK,0.15,Senior Software Engineer,3/1/1993,Senior,534000,1,JP_1046,2010,2022
81,100082,Danielle,Bowler,1399 Goosetown Drive,Saluda,NC,North Carolina,28773,US,United States,...,USD,0.15,Account Manager,4/7/1981,Individual Contributor,59000,1,JP_1020,2010,2023
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4921,104922,William,Connelly,3138 Godfrey Road,New York,New York,New York,10023,US,United States,...,USD,0.20,"Director, Engineering",6/7/1956,Director,140000,1,JP_1045,2021,2022
4951,104952,Charles,Arant,3440 Reynolds Alley,Cypress,California,California,90630,US,United States,...,USD,0.15,CS Operations Specialist,12/5/1958,Individual Contributor,80000,1,JP_1025,2021,2023
4954,104955,Annette,Miller,506 Hill Haven Drive,Killeen,Texas,Texas,76541,US,United States,...,USD,0.15,CS Operations Specialist,8/15/1961,Individual Contributor,80000,1,JP_1025,2021,2023
4955,104956,Walter,Gittens,4508 Arrowood Drive,Jacksonville,Florida,Florida,32202,US,United States,...,USD,0.15,Software Engineer,4/19/1957,Individual Contributor,77000,1,JP_1043,2021,2023
4963,104964,John,Simpson,1381 Neville Street,Evansville,Indiana,Indiana,47711,US,United States,...,USD,0.50,Chief Marketing Officer,11/27/1950,CSuite,370000,1,JP_1051,2021,2022

It shows that there is 700 rows with active status still true for terminated employee. We are going to turn the true value into false.

In [47]:
full_data['Active Status'].loc[(full_data['Active Status']==1) & (full_data['termination_year']>0)]=0
full_data.loc[(full_data['Active Status']==1) & (full_data['termination_year']>0)]

Empty DataFrame
Columns: [EmployeeID, First_Name, Surname, StreetAddress, City, State, StateFull, ZipCode, Country, CountryFull, Age, Office, Start_Date, Termination_Date, Office_Type, Department, Currency, Bonus_pct, Job_title, DOB, level, Salary, Active Status, Job_Profile, start_year, termination_year]
Index: []

[0 rows x 26 columns]

Converting complete, now adding columns.

First, extract the difference in days (we are going to drop this in the end) to make calculations easier for getting months and years.

In [48]:
full_data['diff_in_days']=0

full_data['diff_in_days'].loc[full_data['Active Status']==0]=(full_data['Termination_Date']-full_data['Start_Date'])
full_data['diff_in_days'].loc[full_data['Active Status']==1]=(datetime.today()-full_data['Start_Date'])

full_data['tenure_months']=full_data['diff_in_days']/timedelta(days=30)
full_data['tenure_years']=full_data['diff_in_days']/timedelta(days=365)
full_data.tail(15).loc[:,'Start_Date':]

,Start_Date,Termination_Date,Office_Type,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Job_Profile,start_year,termination_year,diff_in_days,tenure_months,tenure_years
4953,2021-02-08,NaT,Technology,Marketing,USD,0.15,Programmatic Marketing Specialist,6/26/1975,Individual Contributor,49000,1,JP_1028,2021,0,860 days 19:12:35.035740,28.693347,2.358357
4954,2021-09-13,2023-06-18 19:12:34.307585,Corporate,Customer Service,USD,0.15,CS Operations Specialist,8/15/1961,Individual Contributor,80000,0,JP_1025,2021,2023,643 days 19:12:34.307585,21.460013,1.763837
4955,2021-08-30,2023-03-02 00:00:00.000000,Technology,Technology,USD,0.15,Software Engineer,4/19/1957,Individual Contributor,77000,0,JP_1043,2021,2023,549 days 00:00:00,18.300000,1.504110
4956,2021-04-26,NaT,Corporate,Marketing,USD,0.10,"Associate, Marketing",3/6/1950,Associate,120000,1,JP_1030,2021,0,783 days 19:12:35.035740,26.126680,2.147398
4957,2021-11-22,NaT,Technology,Technology,USD,0.15,Software Engineer,8/5/1977,Individual Contributor,77000,1,JP_1043,2021,0,573 days 19:12:35.035740,19.126680,1.572056
4958,2021-11-22,NaT,Corporate,Corporate,USD,0.20,"Manager, Finance",9/6/1979,Manager,110000,1,JP_1053,2021,0,573 days 19:12:35.035740,19.126680,1.572056
4959,2021-11-22,NaT,Corporate,Corporate,USD,0.15,HR Coordinator,11/24/1996,Individual Contributor,50000,1,JP_1007,2021,0,573 days 19:12:35.035740,19.126680,1.572056
4960,2021-04-19,NaT,Corporate,Corporate,USD,0.15,"Manager, Corporate",6/4/1965,Manager,120000,1,JP_1013,2021,0,790 days 19:12:35.035740,26.360014,2.166576
4961,2021-09-13,NaT,Technology,Corporate,USD,0.50,Chief Human Resources Officer,2/5/1957,CSuite,266000,1,JP_1055,2021,0,643 days 19:12:35.035740,21.460014,1.763837
4962,2021-06-21,NaT,Technology,Sales,USD,0.15,Sales Team Lead,12/22/1974,Senior,95000,1,JP_1039,2021,0,727 days 19:12:35.035740,24.260014,1.993974
4963,2021-03-08,2022-11-27 00:00:00.000000,Corporate,Marketing,USD,0.50,Chief Marketing Officer,11/27/1950,CSuite,370000,0,JP_1051,2021,2022,629 days 00:00:00,20.966667,1.723288
4964,2021-01-25,NaT,Technology,Technology,USD,0.15,Software Engineer,7/5/1975,Individual Contributor,77000,1,JP_1043,2021,0,874 days 19:12:35.035740,29.160014,2.396713
4965,2021-08-23,NaT,Corporate,Sales,USD,0.15,Sales Team Lead,4/3/1982,Senior,85500,1,JP_1039,2021,0,664 days 19:12:35.035740,22.160014,1.821371
4966,2021-02-01,NaT,Technology,Technology,USD,0.15,Senior Software Engineer,6/18/2001,Senior,98000,1,JP_1046,2021,0,867 days 19:12:35.035740,28.926680,2.377535
4967,2021-09-06,NaT,Corporate,Corporate,USD,0.50,Chief Financial Officer,2/6/1970,CSuite,390000,1,JP_1054,2021,0,650 days 19:12:35.035740,21.693347,1.783015

Checking other parts of the data

In [49]:
full_data.iloc[4960:,12:]

,Start_Date,Termination_Date,Office_Type,Department,Currency,Bonus_pct,Job_title,DOB,level,Salary,Active Status,Job_Profile,start_year,termination_year,diff_in_days,tenure_months,tenure_years
4960,2021-04-19,NaT,Corporate,Corporate,USD,0.15,"Manager, Corporate",6/4/1965,Manager,120000,1,JP_1013,2021,0,790 days 19:12:35.035740,26.360014,2.166576
4961,2021-09-13,NaT,Technology,Corporate,USD,0.50,Chief Human Resources Officer,2/5/1957,CSuite,266000,1,JP_1055,2021,0,643 days 19:12:35.035740,21.460014,1.763837
4962,2021-06-21,NaT,Technology,Sales,USD,0.15,Sales Team Lead,12/22/1974,Senior,95000,1,JP_1039,2021,0,727 days 19:12:35.035740,24.260014,1.993974
4963,2021-03-08,2022-11-27,Corporate,Marketing,USD,0.50,Chief Marketing Officer,11/27/1950,CSuite,370000,0,JP_1051,2021,2022,629 days 00:00:00,20.966667,1.723288
4964,2021-01-25,NaT,Technology,Technology,USD,0.15,Software Engineer,7/5/1975,Individual Contributor,77000,1,JP_1043,2021,0,874 days 19:12:35.035740,29.160014,2.396713
4965,2021-08-23,NaT,Corporate,Sales,USD,0.15,Sales Team Lead,4/3/1982,Senior,85500,1,JP_1039,2021,0,664 days 19:12:35.035740,22.160014,1.821371
4966,2021-02-01,NaT,Technology,Technology,USD,0.15,Senior Software Engineer,6/18/2001,Senior,98000,1,JP_1046,2021,0,867 days 19:12:35.035740,28.926680,2.377535
4967,2021-09-06,NaT,Corporate,Corporate,USD,0.50,Chief Financial Officer,2/6/1970,CSuite,390000,1,JP_1054,2021,0,650 days 19:12:35.035740,21.693347,1.783015

In [50]:
full_data.drop('diff_in_days', axis=1, inplace=True)

#### Cleaning inconsistent state abbreviation

In [51]:
list(set(full_data['State']))[:10]

[nan, 'MA', 'WV', 'AZ', 'ME', 'MN', 'GA', 'New Hampshire', 'Georgia', 'LA']

We can see from above example that some state is not abbreviated defeating the purpose of `StateFull` column. We are going to replace the full name in `State` to abbreviated code.

Checking if there are any states beside US States

In [52]:
print('Null values for states beside US =',full_data.loc[full_data['Country']!='US']['State'].isna().sum())
full_data.loc[full_data['Country']!='US']['State']

Null values for states beside US = 522

54      NaN
62      NaN
105     NaN
113     NaN
126     NaN
       ...
4474    NaN
4475    NaN
4496    NaN
4520    NaN
4521    NaN
Name: State, Length: 522, dtype: object

We are going to webscrape the table for abbreviation US states.

In [53]:
url='https://www23.statcan.gc.ca/imdb/p3VD.pl?Function=getVD&TVD=53971'

In [54]:
import requests
from bs4 import BeautifulSoup

html_data = requests.get(url).text
html_data

'<!DOCTYPE html>\n\n<!--[if lt IE 9]><html class="no-js lt-ie9" lang="en" dir="ltr"><![endif]--><!--[if gt IE 8]><!-->\n<html class="no-js" lang="en" dir="ltr">\n<!--<![endif]-->\n\n<head>\n<meta charset="utf-8">\n<!-- Web Experience Toolkit (WET) / BoÃ\x83Â®te Ã\x83Â\xa0 outils de l\'expÃ\x83Â©rience Web (BOEW)\n     wet-boew.github.io/wet-boew/License-en.htm / wet-boew.github.io/wet-boew/Licence-fr.htm -->\n\n<title>List of U&#46;S&#46; States with Codes and Abbreviations</title>\n<meta name="description" content="List of U.S. States with Codes and Abbreviations - Table of: Code, State, Abbreviation, Alpha code" />\n<meta name="dcterms.creator" content="Government of Canada, Statistics Canada" />\n<meta name="dcterms.title" content="List of U.S. States with Codes and Abbreviations" />\n<meta name="dcterms.issued" title="W3CDTF" content="2008-12-29" />\n<meta name="dcterms.modified" title="W3CDTF" content="2019-05-06" />\n<meta name="dcterms.subject" title="gcstc" content="none" />\n<meta name="dcterms.language" title="ISO639-2" content="eng" />\n<meta name="keywords" content="Classification, Classification systems, Geographical classification, Geography - Other classifications" />\n<meta name="STCtopic" content="Reference" />\n<meta name="STCtopicID" content="4017" />\n<meta name="STCsubtopic" content="Classification systems and concordances" />\n<meta name="STCsubtopicID" content="4013" />\n<meta name="STCtype" content="Classifications" />\n<meta content="width=device-width,initial-scale=1" name="viewport" />\n\n<!--START css.htm -->\n\n<meta property="dcterms:service" content="StatCan"/> \n<meta property="dcterms:accessRights" content="2"/>\n\n<link href="/wet-boew4b/assets/favicon.ico" rel="icon" type="image/x-icon">\n<link rel="stylesheet" href="/wet-boew4b/css/wet-boew.min.css">\n<script src="/wet-boew4b/js/jquery.min.js"></script>\n\n<link rel="stylesheet" href="/wet-boew4b/css/theme.min.css">\n<link rel="stylesheet" href="/wet-boew4b/css/statcan.css">\n<link rel="stylesheet" href="/wet-boew4b/invitation-manager/Overlay.css"> \n\n<noscript><link rel="stylesheet" href="/wet-boew4b/css/noscript.min.css" /></noscript>\n<!-- Adobe Analytics v5 production version --><script src="//assets.adobedtm.com/be5dfd287373/8cdb3d539c44/launch-6df9e9b447f9.min.js"></script>\n<!-- Adobe Analytics v5 staging version --><!--script src="//assets.adobedtm.com/be5dfd287373/8cdb3d539c44/launch-dfa8abb35555-staging.min.js"></script-->\n\n<script>dataLayer1 = [];</script>\n\n<!-- CustomScriptsCSSStart -->\n<link rel="stylesheet" href="/wet-boew4b/imdb-templates/imdb-standards.css" />\n<!-- CustomScriptsCSSEnd -->\n\n<!--END css.htm -->\n\n</head>\n\n<body vocab="http://schema.org/" typeof="WebPage">\n\n<ul id="wb-tphp">\n<li class="wb-slc">\n<a class="wb-sl" href="#wb-cont">Skip to main content</a>\n</li>\n<li class="wb-slc visible-sm visible-md visible-lg">\n<a class="wb-sl" href="#wb-info">Skip to "About this site"</a>\n</li>\n</ul>\n<header role="banner">\n<div id="wb-bnr" class="container">\n<section id="wb-lng" class="visible-md visible-lg text-right">\n<h2 class="wb-inv">Language selection</h2>\n<div class="row">\n<div class="col-md-12">\n<ul class="list-inline margin-bottom-none">\n<li><a lang="fr" href="\n/imdb/cgi-bin/change.cgi\n">Fran&#231;ais</a></li>\n</ul>\n</div>\n</div>\n</section>\n<div class="row">\n<div class="brand col-xs-8 col-sm-9 col-md-6">\n<a href="https://www.statcan.gc.ca/en/start" property="URL"><img src="/wet-boew4b/assets/sig-blk-en.svg" alt="Statistics Canada"><span class="wb-inv"> / <span lang="fr">Statistique Canada</span></span></a>\n</div>\n<section class="wb-mb-links col-xs-4 col-sm-3 visible-sm visible-xs" id="wb-glb-mn">\n<h2>Search and menus</h2>\n<ul class="list-inline text-right chvrn">\n<li><a href="#mb-pnl" title="Search and menus" aria-controls="mb-pnl" class="overlay-lnk" role="button"><span class="glyphicon glyphicon-search"><span class="glyphicon glyphicon-th-list"><span class="wb-inv">Search and menus</span></span></span></a></li>\n</ul>\n<div id="mb-pnl"></div>\n</section>\n\n<section id="wb-srch" class="col-xs-6 text-right visible-md visible-lg">\n<h2 class="wb-inv">Search</h2>\n<form action="https://www.statcan.gc.ca/search/results/site-search" method="get" name="cse-search-box" role="search" class="form-inline">\n<div class="form-group wb-srch-qry">\n<label for="wb-srch-q" class="wb-inv">Search website</label>\n<input type="hidden" name="fq" value="stclac:2" />\n<input id="wb-srch-q" list="wb-srch-q-ac" class="wb-srch-q form-control" name="q" type="search" value="" size="27" maxlength="150" placeholder="Search website">\n<datalist id="wb-srch-q-ac">\n</datalist>\n</div>\n<div class="form-group submit">\n<button type="submit" id="wb-srch-sub" class="btn btn-primary btn-small" name="wb-srch-sub"><span class="glyphicon-search glyphicon"></span><span class="wb-inv">Search</span></button>\n</div>\n</form>\n</section>\n</div>\n</div>\n\n<nav role="navigation" id="wb-sm" class="wb-menu visible-md visible-lg" data-trgt="mb-pnl" data-ajax-replace="/wet-boew4b/ajax/sitemenu-en.html" typeof="SiteNavigationElement">\n\t<div class="container nvbar">\n\t\t<h2 class="wb-inv">Topics menu</h2>\n\t\t<div class="row">\n\t\t\t<ul class="list-inline menu">\n\t\t\t\t<li><a href="https://www150.statcan.gc.ca/n1/en/subjects?MM=1">Subjects</a></li>\n\t\t\t\t<li><a href="https://www150.statcan.gc.ca/n1/en/type/data?MM=1">Data</a></li>\n\t\t\t\t<li><a href="https://www150.statcan.gc.ca/n1/en/type/analysis?MM=1">Analysis</a></li>\n\t\t\t\t<li><a href="https://www150.statcan.gc.ca/n1/en/type/reference?MM=1">Reference</a></li>\n\t\t\t\t<li><a href="https://www.statcan.gc.ca/en/geography?MM=1">Geography</a></li>\n\t\t\t\t<li><a href="https://www.statcan.gc.ca/en/census?MM=1">Census</a></li>\n\t\t\t\t<li><a href="https://www.statcan.gc.ca/en/surveys?MM=1">Surveys and statistical programs</a></li>\n\t\t\t\t<li><a href="https://www.statcan.gc.ca/en/about/statcan?MM=1">About StatCan</a></li>\n\t\t\t\t<li><a href="https://www.canada.ca/en.html">Canada.ca</a></li>\n\t\t\t</ul>\n\t\t</div>\n\t</div>\n</nav>\n\n<nav role="navigation" id="wb-bc" class="" property="breadcrumb">\n\t<div class="container">\n\t\t<div class="row">\n\n<!-- Breadcrumb trail START-->\n\n<ol class="breadcrumb">\n<li><a href="http://www.statcan.gc.ca/start-debut-eng.html">Home</a></li>\n<li><a href="http://www.statcan.gc.ca/eng/concepts/index">Definitions, data sources and methods</a></li>\n<li><a href="http://www.statcan.gc.ca/eng/concepts/index?MM="> Statistical classifications</a></li>\n</ol>\n\n</div>\n</div>\n</nav>\n</header>\n\n<main role="main" property="mainContentOfPage" class="container">\n<!-- Breadcrumb trail END-->\n\n<h1 property="name" id="wb-cont">List of U&#46;S&#46; States with Codes and Abbreviations</h1>\n<div class="btn-group btn-group-justified hidden-xs hidden-print" role="group">\n<a class="btn btn-default btn-primary" href="http://www23.statcan.gc.ca/imdb/p3VD.pl?Function=getVD&amp;TVD=53971">List of U&#46;S&#46; States with Codes and Abbreviations</a>\n</div>\n<div class="visible-xs mrgn-bttm-sm row active-nav hidden-print">\n<div class="col-xs-12"><a class="btn btn-block btn-primary" href="http://www23.statcan.gc.ca/imdb/p3VD.pl?Function=getVD&amp;TVD=53971">List of U&#46;S&#46; States with Codes and Abbreviations</a></div>\n</div>\n\n\n<!-- Open Content panel -->\n\n<div class="panel panel-default mrgn-tp-0 mrgn-bttm-md">\n\n<!-- Open body panel -->\n\n<div class="panel-body">\n\n<h2 class="mrgn-tp-0">Classification structure</h2>\n<div class="table-responsive">\n<table class="table table-bordered responsive-utilities table-hover table-condensed mrgn-bttm-0">\n<caption class="wb-inv">List of U&#46;S&#46; States with Codes and Abbreviations - Classification structure</caption>\n<thead>\n<tr>\n<th scope="col" class="bg-tbl" id="un_1">Code</th>\n<th scope="col" class="bg-tbl" id="un_2">State</th>\n<th scope="col" class="bg-tbl" id="un_3">Abbreviation</th>\n<th scope="col" class="bg-tbl" id="un_4">Alpha code</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<th id="un_5" headers="un_1">01</th>\n<td headers="un_5 un_2">Alabama</td>\n<td headers="un_5 un_3">Ala&#46;</td>\n<td headers="un_5 un_4">AL</td>\n</tr>\n<tr>\n<th id="un_6" headers="un_1">02</th>\n<td headers="un_6 un_2">Alaska</td>\n<td headers="un_6 un_3"></td>\n<td headers="un_6 un_4">AK</td>\n</tr>\n<tr>\n<th id="un_7" headers="un_1">04</th>\n<td headers="un_7 un_2">Arizona</td>\n<td headers="un_7 un_3">Ariz&#46;</td>\n<td headers="un_7 un_4">AZ</td>\n</tr>\n<tr>\n<th id="un_8" headers="un_1">05</th>\n<td headers="un_8 un_2">Arkansas</td>\n<td headers="un_8 un_3">Ark&#46;</td>\n<td headers="un_8 un_4">AR</td>\n</tr>\n<tr>\n<th id="un_9" headers="un_1">06</th>\n<td headers="un_9 un_2">California</td>\n<td headers="un_9 un_3">Calif&#46;</td>\n<td headers="un_9 un_4">CA</td>\n</tr>\n<tr>\n<th id="un_10" headers="un_1">08</th>\n<td headers="un_10 un_2">Colorado</td>\n<td headers="un_10 un_3">Colo&#46;</td>\n<td headers="un_10 un_4">CO</td>\n</tr>\n<tr>\n<th id="un_11" headers="un_1">09</th>\n<td headers="un_11 un_2">Connecticut</td>\n<td headers="un_11 un_3">Conn&#46;</td>\n<td headers="un_11 un_4">CT</td>\n</tr>\n<tr>\n<th id="un_12" headers="un_1">10</th>\n<td headers="un_12 un_2">Delaware</td>\n<td headers="un_12 un_3">Del&#46;</td>\n<td headers="un_12 un_4">DE</td>\n</tr>\n<tr>\n<th id="un_13" headers="un_1">11</th>\n<td headers="un_13 un_2">District of Columbia</td>\n<td headers="un_13 un_3">D&#46;C&#46;</td>\n<td headers="un_13 un_4">DC</td>\n</tr>\n<tr>\n<th id="un_14" headers="un_1">12</th>\n<td headers="un_14 un_2">Florida</td>\n<td headers="un_14 un_3">Fla&#46;</td>\n<td headers="un_14 un_4">FL</td>\n</tr>\n<tr>\n<th id="un_15" headers="un_1">13</th>\n<td headers="un_15 un_2">Georgia</td>\n<td headers="un_15 un_3">Ga&#46;</td>\n<td headers="un_15 un_4">GA</td>\n</tr>\n<tr>\n<th id="un_16" headers="un_1">15</th>\n<td headers="un_16 un_2">Hawaii</td>\n<td headers="un_16 un_3"></td>\n<td headers="un_16 un_4">HI</td>\n</tr>\n<tr>\n<th id="un_17" headers="un_1">16</th>\n<td headers="un_17 un_2">Idaho</td>\n<td headers="un_17 un_3"></td>\n<td headers="un_17 un_4">ID</td>\n</tr>\n<tr>\n<th id="un_18" headers="un_1">17</th>\n<td headers="un_18 un_2">Illinois</td>\n<td headers="un_18 un_3">Ill&#46;</td>\n<td headers="un_18 un_4">IL</td>\n</tr>\n<tr>\n<th id="un_19" headers="un_1">18</th>\n<td headers="un_19 un_2">Indiana</td>\n<td headers="un_19 un_3">Ind&#46;</td>\n<td headers="un_19 un_4">IN</td>\n</tr>\n<tr>\n<th id="un_20" headers="un_1">19</th>\n<td headers="un_20 un_2">Iowa</td>\n<td headers="un_20 un_3"></td>\n<td headers="un_20 un_4">IA</td>\n</tr>\n<tr>\n<th id="un_21" headers="un_1">20</th>\n<td headers="un_21 un_2">Kansas</td>\n<td headers="un_21 un_3">Kans&#46;</td>\n<td headers="un_21 un_4">KS</td>\n</tr>\n<tr>\n<th id="un_22" headers="un_1">21</th>\n<td headers="un_22 un_2">Kentucky</td>\n<td headers="un_22 un_3">Ky&#46;</td>\n<td headers="un_22 un_4">KY</td>\n</tr>\n<tr>\n<th id="un_23" headers="un_1">22</th>\n<td headers="un_23 un_2">Louisiana</td>\n<td headers="un_23 un_3"></td>\n<td headers="un_23 un_4">LA</td>\n</tr>\n<tr>\n<th id="un_24" headers="un_1">23</th>\n<td headers="un_24 un_2">Maine</td>\n<td headers="un_24 un_3">Me&#46;</td>\n<td headers="un_24 un_4">ME</td>\n</tr>\n<tr>\n<th id="un_25" headers="un_1">24</th>\n<td headers="un_25 un_2">Maryland</td>\n<td headers="un_25 un_3">Md&#46;</td>\n<td headers="un_25 un_4">MD</td>\n</tr>\n<tr>\n<th id="un_26" headers="un_1">25</th>\n<td headers="un_26 un_2">Massachusetts</td>\n<td headers="un_26 un_3">Mass&#46;</td>\n<td headers="un_26 un_4">MA</td>\n</tr>\n<tr>\n<th id="un_27" headers="un_1">26</th>\n<td headers="un_27 un_2">Michigan</td>\n<td headers="un_27 un_3">Mich&#46;</td>\n<td headers="un_27 un_4">MI</td>\n</tr>\n<tr>\n<th id="un_28" headers="un_1">27</th>\n<td headers="un_28 un_2">Minnesota</td>\n<td headers="un_28 un_3">Minn&#46;</td>\n<td headers="un_28 un_4">MN</td>\n</tr>\n<tr>\n<th id="un_29" headers="un_1">28</th>\n<td headers="un_29 un_2">Mississippi</td>\n<td headers="un_29 un_3">Miss&#46;</td>\n<td headers="un_29 un_4">MS</td>\n</tr>\n<tr>\n<th id="un_30" headers="un_1">29</th>\n<td headers="un_30 un_2">Missouri</td>\n<td headers="un_30 un_3">Mo&#46;</td>\n<td headers="un_30 un_4">MO</td>\n</tr>\n<tr>\n<th id="un_31" headers="un_1">30</th>\n<td headers="un_31 un_2">Montana</td>\n<td headers="un_31 un_3">Mont&#46;</td>\n<td headers="un_31 un_4">MT</td>\n</tr>\n<tr>\n<th id="un_32" headers="un_1">31</th>\n<td headers="un_32 un_2">Nebraska</td>\n<td headers="un_32 un_3">Nebr&#46;</td>\n<td headers="un_32 un_4">NE</td>\n</tr>\n<tr>\n<th id="un_33" headers="un_1">32</th>\n<td headers="un_33 un_2">Nevada</td>\n<td headers="un_33 un_3">Nev&#46;</td>\n<td headers="un_33 un_4">NV</td>\n</tr>\n<tr>\n<th id="un_34" headers="un_1">33</th>\n<td headers="un_34 un_2">New Hampshire</td>\n<td headers="un_34 un_3">N&#46;H&#46;</td>\n<td headers="un_34 un_4">NH</td>\n</tr>\n<tr>\n<th id="un_35" headers="un_1">34</th>\n<td headers="un_35 un_2">New Jersey</td>\n<td headers="un_35 un_3">N&#46;J&#46;</td>\n<td headers="un_35 un_4">NJ</td>\n</tr>\n<tr>\n<th id="un_36" headers="un_1">35</th>\n<td headers="un_36 un_2">New Mexico</td>\n<td headers="un_36 un_3">N&#46;Mex&#46;</td>\n<td headers="un_36 un_4">NM</td>\n</tr>\n<tr>\n<th id="un_37" headers="un_1">36</th>\n<td headers="un_37 un_2">New York</td>\n<td headers="un_37 un_3">N&#46;Y&#46;</td>\n<td headers="un_37 un_4">NY</td>\n</tr>\n<tr>\n<th id="un_38" headers="un_1">37</th>\n<td headers="un_38 un_2">North Carolina</td>\n<td headers="un_38 un_3">N&#46;C&#46;</td>\n<td headers="un_38 un_4">NC</td>\n</tr>\n<tr>\n<th id="un_39" headers="un_1">38</th>\n<td headers="un_39 un_2">North Dakota</td>\n<td headers="un_39 un_3"></td>\n<td headers="un_39 un_4">ND</td>\n</tr>\n<tr>\n<th id="un_40" headers="un_1">39</th>\n<td headers="un_40 un_2">Ohio</td>\n<td headers="un_40 un_3"></td>\n<td headers="un_40 un_4">OH</td>\n</tr>\n<tr>\n<th id="un_41" headers="un_1">40</th>\n<td headers="un_41 un_2">Oklahoma</td>\n<td headers="un_41 un_3">Okla&#46;</td>\n<td headers="un_41 un_4">OK</td>\n</tr>\n<tr>\n<th id="un_42" headers="un_1">41</th>\n<td headers="un_42 un_2">Oregon</td>\n<td headers="un_42 un_3">Ore&#46;</td>\n<td headers="un_42 un_4">OR</td>\n</tr>\n<tr>\n<th id="un_43" headers="un_1">42</th>\n<td headers="un_43 un_2">Pennsylvania</td>\n<td headers="un_43 un_3">Penn&#46;</td>\n<td headers="un_43 un_4">PA</td>\n</tr>\n<tr>\n<th id="un_44" headers="un_1">44</th>\n<td headers="un_44 un_2">Rhode Island</td>\n<td headers="un_44 un_3">R&#46;I&#46;</td>\n<td headers="un_44 un_4">RI</td>\n</tr>\n<tr>\n<th id="un_45" headers="un_1">45</th>\n<td headers="un_45 un_2">South Carolina</td>\n<td headers="un_45 un_3">S&#46;C&#46;</td>\n<td headers="un_45 un_4">SC</td>\n</tr>\n<tr>\n<th id="un_46" headers="un_1">46</th>\n<td headers="un_46 un_2">South Dakota</td>\n<td headers="un_46 un_3"></td>\n<td headers="un_46 un_4">SD</td>\n</tr>\n<tr>\n<th id="un_47" headers="un_1">47</th>\n<td headers="un_47 un_2">Tennessee</td>\n<td headers="un_47 un_3">Tenn&#46;</td>\n<td headers="un_47 un_4">TN</td>\n</tr>\n<tr>\n<th id="un_48" headers="un_1">48</th>\n<td headers="un_48 un_2">Texas</td>\n<td headers="un_48 un_3">Tex&#46;</td>\n<td headers="un_48 un_4">TX</td>\n</tr>\n<tr>\n<th id="un_49" headers="un_1">49</th>\n<td headers="un_49 un_2">Utah</td>\n<td headers="un_49 un_3"></td>\n<td headers="un_49 un_4">UT</td>\n</tr>\n<tr>\n<th id="un_50" headers="un_1">50</th>\n<td headers="un_50 un_2">Vermont</td>\n<td headers="un_50 un_3">Vt&#46;</td>\n<td headers="un_50 un_4">VT</td>\n</tr>\n<tr>\n<th id="un_51" headers="un_1">51</th>\n<td headers="un_51 un_2">Virginia</td>\n<td headers="un_51 un_3">Va&#46;</td>\n<td headers="un_51 un_4">VA</td>\n</tr>\n<tr>\n<th id="un_52" headers="un_1">53</th>\n<td headers="un_52 un_2">Washington</td>\n<td headers="un_52 un_3">Wash&#46;</td>\n<td headers="un_52 un_4">WA</td>\n</tr>\n<tr>\n<th id="un_53" headers="un_1">54</th>\n<td headers="un_53 un_2">West Virginia</td>\n<td headers="un_53 un_3">W&#46;Va&#46;</td>\n<td headers="un_53 un_4">WV</td>\n</tr>\n<tr>\n<th id="un_54" headers="un_1">55</th>\n<td headers="un_54 un_2">Wisconsin</td>\n<td headers="un_54 un_3">Wis&#46;</td>\n<td headers="un_54 un_4">WI</td>\n</tr>\n<tr>\n<th id="un_55" headers="un_1">56</th>\n<td headers="un_55 un_2">Wyoming</td>\n<td headers="un_55 un_3">Wyo&#46;</td>\n<td headers="un_55 un_4">WY</td>\n</tr>\n</tbody>\n</table>\n</div>\n\n\n</div><!-- Close panel-body -->\n\n</div><!-- Close panel -->\n\n<!-- ContentEnd -->\n\n<div class="pagedetails">\n\t<div class="row">\n\t\t<div class="col-sm-6 col-lg-4 mrgn-tp-sm">\n\t\t\t<details class="brdr-0">\n\t\t\t\t<summary class="btn btn-default text-center">Report a problem on this page</summary>\n\t\t\t\t<div class="clearfix"></div>\n\t\t\t\t<div class="well row">\n\t\t\t\t\t<div class="gc-rprt-prblm">\n\t\t\t\t\t\t<div class="gc-rprt-prblm-frm gc-rprt-prblm-tggl">\n\t\t\t\t\t\t\t<p>Is something not working? Is there information outdated? Can\'t find what you\'re looking for?</p>\n\t\t\t\t\t\t\t<p>Please <a href="https://www.statcan.gc.ca/eng/reference/refcentre/index?MM=RAP">contact us</a> and let us know how we can help you.</p>\n\t\t\t\t\t\t\t<p><a href="https://www.statcan.gc.ca/eng/reference/privacy?MM=RAP">Privacy notice</a></p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t</div>\n\t\t\t</details>\n\t\t</div>\n\t\t<!-- Share button -->\n\t\t<div class="wb-share col-sm-3 text-right pull-right mrgn-tp-sm" data-wb-share=\'{"lnkClass": "btn btn-default btn-block"}\'></div>\n\t\t<!-- END Share button -->\n\t</div>\n\t<dl id="wb-dtmd">\n\t\t<dt>Date modified:&#32;</dt>\n\t\t<dd><time property="dateModified">\n2019-05-06\n</time></dd>\n\t</dl>\n</div>\n</main>\n\n<footer id="wb-info">\n\t<h2 class="wb-inv">About this site</h2>\n\t<div class="gc-contextual">\n\t\t<div class="container">\n\t\t\t<nav>\n\t\t\t\t<h3>Statistics Canada</h3>\n\t\t\t\t<ul class="list-unstyled colcount-sm-2 colcount-md-3">\n\t\t\t\t\t<li><a href="https://www.statcan.gc.ca/en/reference/refcentre/index">Contact StatCan</a></li>\n\t\t\t\t\t<li><a href="https://www.statcan.gc.ca/en/trust">Trust Centre</a></li>\n\t\t\t\t</ul>\n\t\t\t</nav>\n\t\t</div>\n\t</div>\n\t<div class="gc-main-footer">\n\t\t<div class="container">\n\t\t\t<nav>\n\t\t\t\t<h3>Government of Canada</h3>\n\t\t\t\t<ul class="list-unstyled colcount-sm-2 colcount-md-3">\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/contact.html">All contacts</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/government/dept.html">Departments and agencies</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/government/system.html">About government</a></li>\n\t\t\t\t</ul>\n\t\t\t\t<h4><span class="wb-inv">Themes and topics</span></h4>\n\t\t\t\t<ul class="list-unstyled colcount-sm-2 colcount-md-3">\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/jobs.html">Jobs</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/immigration-citizenship.html">Immigration and citizenship</a></li>\n\t\t\t\t\t<li><a href="https://travel.gc.ca/">Travel and tourism</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/business.html">Business</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/benefits.html">Benefits</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/health.html">Health</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/taxes.html">Taxes</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/environment.html">Environment and natural resources</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/defence.html">National security and defence</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/culture.html">Culture, history and sport</a></li>\n\t\t\t\t\t<li><a href="https://www.canada.ca/en/services/policing.h

In [55]:
soup = BeautifulSoup(html_data, 'html5lib')

In [56]:
table = soup.find_all('table')[0] # The located table

In [57]:
table_dict = {}

table_dict['StateFull']=[]
table_dict['Alpha code']=[]

i = 0
for row in table.find_all('td'): # Iterate rows
    if i%3==0 and i!=0: # There are 3 columns in 'td' element, we need to iterate every 3 column to get to the new row
        i=0 # reset i
    # Extract state name
    if i==0: 
        table_dict['StateFull'].append(' '.join(row.contents))
    # Extract state code
    if i==2:
        table_dict['Alpha code'].append(' '.join(row.contents))
    i+=1

In [58]:
state_df = pd.DataFrame(table_dict)
state_df.head()

    StateFull Alpha code
0     Alabama         AL
1      Alaska         AK
2     Arizona         AZ
3    Arkansas         AR
4  California         CA

In [59]:
full_data=full_data.merge(state_df, on='StateFull', how='left')
full_data.head()

,EmployeeID,First_Name,Surname,StreetAddress,City,State,StateFull,ZipCode,Country,CountryFull,...,DOB,level,Salary,Active Status,Job_Profile,start_year,termination_year,tenure_months,tenure_years,Alpha code
0,100001,Patrice,Moore,1427 Buckhannan Avenue,North Syracuse,NY,New York,13212,US,United States,...,1/5/1986,CSuite,500000,1,JP_1000,2009,0,171.960014,14.133700,NY
1,100002,David,Rickards,4265 Graystone Lakes,Macon,GA,Georgia,31206,US,United States,...,7/13/1971,Manager,70000,1,JP_1001,2009,0,171.960014,14.133700,GA
2,100003,Grace,Maldonado,1680 Hudson Street,Weehawken,NJ,New Jersey,07087,US,United States,...,1/25/1989,Individual Contributor,77000,0,JP_1027,2009,2013,49.300000,4.052055,NJ
3,100004,Justin,Edgin,1262 Limer Street,Rome,GA,Georgia,30165,US,United States,...,5/1/1996,CSuite,400000,0,JP_1041,2009,2013,52.566667,4.320548,GA
4,100005,Benjamin,Vargas,2431 Rainbow Road,Santa Ana,CA,California,92705,US,United States,...,5/5/1972,Manager,51000,0,JP_1018,2009,2011,18.200000,1.495890,CA

Adding Washington DC state manually as DC. This is because there are 2 washington's in the data, Washington DC and Washington. The correct state name for Washington DC is District of Columbia, so we are going to change that as well.

In [61]:
full_data.loc[full_data['Country']!='US']['Alpha code'] # Check whether there are still the same number of null values

54      NaN
62      NaN
105     NaN
113     NaN
126     NaN
       ...
4474    NaN
4475    NaN
4496    NaN
4520    NaN
4521    NaN
Name: Alpha code, Length: 522, dtype: object

In [62]:
full_data.drop('State', axis=1, inplace=True)
full_data.rename(columns={'Alpha code':'State_code'}, inplace=True)
full_data.head()

,EmployeeID,First_Name,Surname,StreetAddress,City,StateFull,ZipCode,Country,CountryFull,Age,...,DOB,level,Salary,Active Status,Job_Profile,start_year,termination_year,tenure_months,tenure_years,State_code
0,100001,Patrice,Moore,1427 Buckhannan Avenue,North Syracuse,New York,13212,US,United States,35,...,1/5/1986,CSuite,500000,1,JP_1000,2009,0,171.960014,14.133700,NY
1,100002,David,Rickards,4265 Graystone Lakes,Macon,Georgia,31206,US,United States,49,...,7/13/1971,Manager,70000,1,JP_1001,2009,0,171.960014,14.133700,GA
2,100003,Grace,Maldonado,1680 Hudson Street,Weehawken,New Jersey,07087,US,United States,32,...,1/25/1989,Individual Contributor,77000,0,JP_1027,2009,2013,49.300000,4.052055,NJ
3,100004,Justin,Edgin,1262 Limer Street,Rome,Georgia,30165,US,United States,25,...,5/1/1996,CSuite,400000,0,JP_1041,2009,2013,52.566667,4.320548,GA
4,100005,Benjamin,Vargas,2431 Rainbow Road,Santa Ana,California,92705,US,United States,49,...,5/5/1972,Manager,51000,0,JP_1018,2009,2011,18.200000,1.495890,CA

In [63]:
full_data['State_code'].loc[full_data['StateFull']=='Washington DC']='DC'
full_data['StateFull'].loc[full_data['State_code']=='DC']='District of Columbia'
full_data.loc[full_data['State_code']=='DC']

,EmployeeID,First_Name,Surname,StreetAddress,City,StateFull,ZipCode,Country,CountryFull,Age,...,DOB,level,Salary,Active Status,Job_Profile,start_year,termination_year,tenure_months,tenure_years,State_code
661,100662,Jerome,Hamlin,273 School Street,Washington,District of Columbia,20036,US,United States,41,...,1/13/1980,Individual Contributor,66000,1,JP_1007,2012,0,130.893347,10.758357,DC
686,100687,Charles,Smith,1299 Rhode Island Avenue,Silver Spring,District of Columbia,20904,US,United States,31,...,8/18/1989,Individual Contributor,95000,0,JP_1043,2012,2020,89.166667,7.328767,DC
882,100883,James,Maynard,3350 School Street,Washington,District of Columbia,20005,US,United States,53,...,1/14/1968,Senior,98000,0,JP_1046,2013,2023,122.493347,10.067946,DC
1115,101116,Justin,Sherwood,4184 Passaic Street,Washington,District of Columbia,20036,US,United States,31,...,12/20/1989,Associate,83000,0,JP_1030,2014,2015,23.233333,1.909589,DC
1255,101256,John,McArthur,1729 Hickory Lane,Washington,District of Columbia,20009,US,United States,46,...,1/28/1975,Senior,97000,1,JP_1046,2014,0,111.993347,9.204933,DC
1335,101336,Thomas,Cantrell,421 Hickory Lane,Beltsville,District of Columbia,20705,US,United States,49,...,3/6/1972,Individual Contributor,56000,0,JP_1020,2014,2015,10.166667,0.835616,DC
1701,101702,Willard,Gonzales,1140 Passaic Street,Washington,District of Columbia,20005,US,United States,62,...,2/7/1959,Individual Contributor,90000,1,JP_1043,2015,0,101.260014,8.322741,DC
2026,102027,Nathan,Romano,3351 Massachusetts Avenue,Washington,District of Columbia,20005,US,United States,29,...,2/29/1992,Senior,95000,0,JP_1046,2015,2016,3.800000,0.312329,DC
2315,102316,Mary,Elliot,3439 Hickory Lane,Washington,District of Columbia,20007,US,United States,48,...,6/15/1973,Individual Contributor,65000,0,JP_1007,2016,2018,19.900000,1.635616,DC
2788,102789,Joan,Escobar,2389 Hickory Lane,Washington,District of Columbia,20017,US,United States,25,...,9/12/1995,Individual Contributor,97000,0,JP_1043,2017,2018,20.100000,1.652055,DC
2937,102938,Alexis,Reid,170 Goldcliff Circle,Washington,District of Columbia,20032,US,United States,50,...,6/28/1971,Individual Contributor,73000,0,JP_1034,2017,2019,22.366667,1.838356,DC
3058,103059,Donna,Holman,2060 Hickory Lane,Washington,District of Columbia,20009,US,United States,62,...,4/6/1959,Individual Contributor,55000,0,JP_1020,2017,2019,25.200000,2.071233,DC
3765,103766,Mike,Lewis,1765 Rhode Island Avenue,Silver Spring,District of Columbia,20904,US,United States,27,...,5/18/1994,Individual Contributor,83000,0,JP_1028,2018,2021,40.800000,3.353425,DC
3777,103778,John,Moody,2440 Northwest Boulevard,Washington,District of Columbia,20005,US,United States,59,...,8/28/1961,Senior,99000,0,JP_1046,2018,2019,8.200000,0.673973,DC
4199,104200,Nancy,Locke,1833 Goldcliff Circle,Washington,District of Columbia,20009,US,United States,40,...,7/15/1980,Manager,82000,0,JP_1032,2018,2020,20.433333,1.679452,DC
4652,104653,Anita,Bucher,3520 Hickory Lane,Savage,District of Columbia,20763,US,United States,42,...,8/31/1978,Individual Contributor,50000,1,JP_1006,2021,0,27.060014,2.224111,DC
4885,104886,Edward,Flores,3748 School Street,Washington,District of Columbia,20024,US,United States,47,...,4/29/1974,Manager,85000,1,JP_1023,2021,0,22.160014,1.821371,DC

In [64]:
# Check whether state_code is an abbreviation now
set(full_data['State_code'])

{'AK',
 'AL',
 'AR',
 'AZ',
 'CA',
 'CO',
 'CT',
 'DC',
 'DE',
 'FL',
 'GA',
 'HI',
 'IA',
 'ID',
 'IL',
 'IN',
 'KS',
 'KY',
 'LA',
 'MA',
 'MD',
 'ME',
 'MI',
 'MN',
 'MO',
 'MS',
 'MT',
 'NC',
 'ND',
 'NE',
 'NH',
 'NJ',
 'NM',
 'NV',
 'NY',
 'OH',
 'OK',
 'OR',
 'PA',
 'RI',
 'SC',
 'SD',
 'TN',
 'TX',
 'UT',
 'VA',
 'VT',
 'WA',
 'WI',
 'WV',
 'WY',
 nan}

Update age to reflect current year

In [85]:
full_data['DOB']=pd.to_datetime(full_data['DOB'])
round((datetime.today()-full_data['DOB'])/timedelta(days=365))

0       37.0
1       52.0
2       34.0
3       27.0
4       51.0
        ...
4963    73.0
4964    48.0
4965    41.0
4966    22.0
4967    53.0
Name: DOB, Length: 4968, dtype: float64

In [86]:
full_data['Age']

0       35
1       49
2       32
3       25
4       49
        ..
4963    70
4964    46
4965    39
4966    20
4967    51
Name: Age, Length: 4968, dtype: int64

The full data (or main data) is a join of the other 3 data (except survey). It includes all details about the employee.

In [65]:
log("Transformation that were done in full data {0} :".format(datetime.today()))
log("- Replacing termination date value of 12/12/2999 to NaN")
log("- Converting violating termination date values to today's date")
log("- Drop 'notes' column")
log("- Adding start_year and termination_year")
log("- Inactivating status for terminated employees")
log("- Adding tenure_year and tenure_months")
log("- Cleaning state column")

Transformation that were done in full data 2023-06-18 19:14:37.273685 :
- Replacing termination date value of 12/12/2999 to NaN
- Converting violating termination date values to today's date
- Drop 'notes' column
- Adding start_year and termination_year
- Inactivating status for terminated employees
- Adding tenure_year and tenure_months
- Cleaning state column

## Demographic Data

In [66]:
demographic_data.head(10)

,EmployeeID,Gender,Gender Identity,Race/Ethnicity,Veteran,Disability,Education,Sexual Orientation
0,100001,female,female,White,0,0,Undergraduate,Heterosexual
1,100002,male,male,White,0,1,Undergraduate,Heterosexual
2,100003,female,female,Asian,0,0,Undergraduate,Heterosexual
3,100004,male,male,White,0,0,Undergraduate,Heterosexual
4,100005,male,male,Hispanic or Latino,0,0,Undergraduate,Missing
5,100006,male,Prefer not to say,White,0,0,Undergraduate,Heterosexual
6,100007,male,male,Asian,0,0,Some College,Bisexual
7,100008,female,female,White,0,0,High School,Missing
8,100009,male,male,White,0,0,Undergraduate,Heterosexual
9,100010,male,male,White,0,0,PhD,Gay

In [67]:
demographic_data.isna().sum()

EmployeeID              0
Gender                  0
Gender Identity         0
Race/Ethnicity        549
Veteran                 0
Disability              0
Education               0
Sexual Orientation      0
dtype: int64

In [68]:
demographic_data.describe(include='all')

,EmployeeID,Gender,Gender Identity,Race/Ethnicity,Veteran,Disability,Education,Sexual Orientation
count,4968.000000,4968,4968,4419,4968.000000,4968.000000,4968,4968
unique,NaN,2,5,9,NaN,NaN,5,6
top,NaN,male,male,White,NaN,NaN,Undergraduate,Heterosexual
freq,NaN,2570,2308,2658,NaN,NaN,3288,3141
mean,102484.500000,NaN,NaN,NaN,0.047504,0.042271,NaN,NaN
std,1434.282399,NaN,NaN,NaN,0.212736,0.201226,NaN,NaN
min,100001.000000,NaN,NaN,NaN,0.000000,0.000000,NaN,NaN
25%,101242.750000,NaN,NaN,NaN,0.000000,0.000000,NaN,NaN
50%,102484.500000,NaN,NaN,NaN,0.000000,0.000000,NaN,NaN
75%,103726.250000,NaN,NaN,NaN,0.000000,0.000000,NaN,NaN
max,104968.000000,NaN,NaN,NaN,1.000000,1.000000,NaN,NaN

Investigating null values in Race/Ethnicity column

In [69]:
set(demographic_data['Race/Ethnicity'])

{'American Indian or Alaska Native',
 'Asian',
 'Black or African American',
 'Hispanic or Latino',
 'Native American or Alaska Native',
 'Native Hawaiian or Other Pacific Islander',
 'Native Hawaiian or Pacific Islander',
 'Two or More Races',
 'White',
 nan}

We have 9 unique ethnicities in the data. For `NaN` values, I will treat is as `Prefer not to say` as it will be more meaningful for our data analysis purposes.

In [70]:
demographic_data.loc[demographic_data['Race/Ethnicity'].isna()].head(5)

,EmployeeID,Gender,Gender Identity,Race/Ethnicity,Veteran,Disability,Education,Sexual Orientation
54,100055,male,male,NaN,0,0,Undergraduate,Heterosexual
62,100063,male,Prefer not to say,NaN,0,0,Undergraduate,Heterosexual
105,100106,female,female,NaN,0,0,Graduate,Heterosexual
113,100114,female,female,NaN,0,0,Undergraduate,Heterosexual
126,100127,female,female,NaN,0,0,Undergraduate,Missing

In [71]:
demographic_data['Race/Ethnicity'].fillna('Prefer not to say', inplace=True)
demographic_data.loc[demographic_data['Race/Ethnicity'].isna()]

Empty DataFrame
Columns: [EmployeeID, Gender, Gender Identity, Race/Ethnicity, Veteran, Disability, Education, Sexual Orientation]
Index: []

This also removes all null values from demographic data.

## Survey Data

In [72]:
survey_data.head(10)

,EmployeeID,Survey,I would recommend my friends or Family to work at TheCompany,I feel engaged in my work.,I believe Leadership cares about the employees at TheCompany,My manager supports me in my role at TheCompany,"TheCompany cares about Diversity, Equity and Inclusion.",I believe there is room for me to grow at TheCompany,I work on interesting projects.,My manager motivates me to work hard.,...,I believe TheCompany is in a great position in the market for the next few years to be succesful.,I plan on staying with TheCompany for at least 2 more years.,I believe I am fairly compensated for my work.,I believe there is little to not politics at TheCompany,I feel comfortable going to someone in leadership if there is an issue.,My values align with the culture at TheCompany,I know what TheCompany values are at TheCompany,I feel like I can take off my accrued Paid Time Off (PTO)/Vacation without feeling guilty,What does TheCompany do well?,What can TheCompany improve?
0,100001,2023Q2,3,3,2,1,1,3,2,4,...,3,4,2,2,4,4,3,3,NaN,NaN
1,100002,2023Q2,3,4,2,4,2,4,4,2,...,3,1,5,1,2,4,3,1,NaN,NaN
2,100009,2023Q2,3,4,2,3,4,3,2,2,...,1,1,3,2,2,3,2,4,NaN,NaN
3,100014,2023Q2,4,1,5,2,5,3,4,4,...,3,4,2,2,4,3,3,2,NaN,NaN
4,100018,2023Q2,4,1,1,1,2,3,1,3,...,4,3,2,4,3,2,2,3,NaN,NaN
5,100020,2023Q2,3,3,4,1,4,2,2,2,...,4,3,4,4,3,1,1,3,NaN,NaN
6,100021,2023Q2,4,1,4,2,2,4,4,1,...,2,3,4,2,3,4,4,4,NaN,NaN
7,100024,2023Q2,4,3,4,2,2,2,2,3,...,3,3,3,4,3,2,2,2,NaN,NaN
8,100031,2023Q2,4,4,2,4,3,4,4,4,...,3,4,4,1,3,2,2,4,NaN,NaN
9,100038,2023Q2,3,2,3,2,3,3,1,3,...,2,2,3,4,3,2,4,4,NaN,NaN

In [73]:
survey_data.describe(include='all').iloc[:,:10]

,EmployeeID,Survey,I would recommend my friends or Family to work at TheCompany,I feel engaged in my work.,I believe Leadership cares about the employees at TheCompany,My manager supports me in my role at TheCompany,"TheCompany cares about Diversity, Equity and Inclusion.",I believe there is room for me to grow at TheCompany,I work on interesting projects.,My manager motivates me to work hard.
count,2827.000000,2827,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000
unique,NaN,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,2023Q2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,2827,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,102732.819950,NaN,2.919703,2.931022,2.925716,2.907676,2.881854,2.901309,2.933498,2.931022
std,1443.057615,NaN,0.990180,1.025774,1.001485,1.016652,0.995840,1.012216,1.009421,1.002041
min,100001.000000,NaN,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,101481.000000,NaN,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000
50%,102786.000000,NaN,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000
75%,104030.500000,NaN,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000
max,104968.000000,NaN,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000

In [74]:
survey_data.describe(include='all').iloc[:,10:]

,I am motivated to work hard at TheCompany.,I believe I am recognized for the work I do.,I believe there are good career opportunities for me at TheCompany.,I believe TheCompany is in a great position in the market for the next few years to be succesful.,I plan on staying with TheCompany for at least 2 more years.,I believe I am fairly compensated for my work.,I believe there is little to not politics at TheCompany,I feel comfortable going to someone in leadership if there is an issue.,My values align with the culture at TheCompany,I know what TheCompany values are at TheCompany,I feel like I can take off my accrued Paid Time Off (PTO)/Vacation without feeling guilty,What does TheCompany do well?,What can TheCompany improve?
count,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,2827.000000,0.0,0.0
unique,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,2.936328,2.938451,2.922179,2.941988,2.922179,2.921825,2.915104,2.923594,2.895649,2.940927,2.914751,NaN,NaN
std,1.001863,0.997749,1.018040,1.012394,1.020470,0.998180,1.002408,1.020923,1.031050,1.022592,1.024549,NaN,NaN
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,NaN,NaN
25%,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000,NaN,NaN
50%,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,3.000000,NaN,NaN
75%,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,NaN,NaN
max,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000,NaN,NaN

The survey is a rating with a range of 1-5 with 5 being the highest. There is 19 questions for the survey. Two additional questions was for feedback towards TheCompany. I am going to extract the `quarter` value from `Survey` column.

In [75]:
survey_data['survey_quarter']=survey_data['Survey'].str[-2:]
survey_data.head().iloc[:,16:]

,I believe there is little to not politics at TheCompany,I feel comfortable going to someone in leadership if there is an issue.,My values align with the culture at TheCompany,I know what TheCompany values are at TheCompany,I feel like I can take off my accrued Paid Time Off (PTO)/Vacation without feeling guilty,What does TheCompany do well?,What can TheCompany improve?,survey_quarter
0,2,4,4,3,3,NaN,NaN,Q2
1,1,2,4,3,1,NaN,NaN,Q2
2,2,2,3,2,4,NaN,NaN,Q2
3,2,4,3,3,2,NaN,NaN,Q2
4,4,3,2,2,3,NaN,NaN,Q2

Let's look at the null values

In [76]:
survey_data.isna().sum()

EmployeeID                                                                                              0
Survey                                                                                                  0
I would recommend my friends or Family to work at TheCompany                                            0
I feel engaged in my work.                                                                              0
I believe Leadership cares about the employees at TheCompany                                            0
My manager supports me in my role at TheCompany                                                         0
TheCompany cares about Diversity, Equity and Inclusion.                                                 0
I believe there is room for me to grow at TheCompany                                                    0
I work on interesting projects.                                                                         0
My manager motivates me to work hard.                                                                   0
I am motivated to work hard at TheCompany.                                                              0
I believe I am recognized for the work I do.                                                            0
I believe there are good career opportunities for me at TheCompany.                                     0
I believe TheCompany is in a great position in the market for the next few years to be succesful.       0
I plan on staying with TheCompany for at least 2 more years.                                            0
I believe I am fairly compensated for my work.                                                          0
I believe there is little to not politics at TheCompany                                                 0
I feel comfortable going to someone in leadership if there is an issue.                                 0
My values align with the culture at TheCompany                                                          0
I know what TheCompany values are at TheCompany                                                         0
I feel like I can take off my accrued Paid Time Off (PTO)/Vacation without feeling guilty               0
What does TheCompany do well?                                                                        2827
What can TheCompany improve?                                                                         2827
survey_quarter                                                                                          0
dtype: int64

All rows for the feedback columns i.e. `What does TheCompany do well?` and `What can TheCompany improve?` are null. We are going to remove those columns because at this stage it does not give any information.

In [77]:
survey_data.drop(['What does TheCompany do well?','What can TheCompany improve?'], axis=1,
                inplace=True)
survey_data.head()

,EmployeeID,Survey,I would recommend my friends or Family to work at TheCompany,I feel engaged in my work.,I believe Leadership cares about the employees at TheCompany,My manager supports me in my role at TheCompany,"TheCompany cares about Diversity, Equity and Inclusion.",I believe there is room for me to grow at TheCompany,I work on interesting projects.,My manager motivates me to work hard.,...,I believe there are good career opportunities for me at TheCompany.,I believe TheCompany is in a great position in the market for the next few years to be succesful.,I plan on staying with TheCompany for at least 2 more years.,I believe I am fairly compensated for my work.,I believe there is little to not politics at TheCompany,I feel comfortable going to someone in leadership if there is an issue.,My values align with the culture at TheCompany,I know what TheCompany values are at TheCompany,I feel like I can take off my accrued Paid Time Off (PTO)/Vacation without feeling guilty,survey_quarter
0,100001,2023Q2,3,3,2,1,1,3,2,4,...,2,3,4,2,2,4,4,3,3,Q2
1,100002,2023Q2,3,4,2,4,2,4,4,2,...,4,3,1,5,1,2,4,3,1,Q2
2,100009,2023Q2,3,4,2,3,4,3,2,2,...,2,1,1,3,2,2,3,2,4,Q2
3,100014,2023Q2,4,1,5,2,5,3,4,4,...,3,3,4,2,2,4,3,3,2,Q2
4,100018,2023Q2,4,1,1,1,2,3,1,3,...,4,4,3,2,4,3,2,2,3,Q2

In [78]:
log('Transformation done in --- %s seconds ---' % (time.time()-start_time))

Transformation done in --- 124.50651621818542 seconds ---

We just dropped the two empty columns and add survey time `quarter` to the data.  
Now, let's load the data into a new dataset.

## Loading Phase

In [79]:
log('Loading Data ...')
start_time = time.time()

Loading Data ...

In [80]:
company_data.to_csv('cleanData/company_details.csv', index=False)
job_data.to_csv('cleanData/job_details.csv', index=False)
full_data.to_csv('cleanData/main_data.csv', index=False)
demographic_data.to_csv('cleanData/employee_details.csv', index=False)
survey_data.to_csv('cleanData/survey_data.csv', index=False)

In [81]:
log('Loading done in --- %s seconds ---' % (time.time()-start_time))
log('\n')

Loading done in --- 0.20245862007141113 seconds ---